---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionComponentsRelationship
source: html/a78a8a49-773b-f692-5aca-42e48bb67225.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionComponentsRelationship Property

Cannot create custom connection due to relationships to external elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralCustomConnectionComponentsRelationship { get; }
```